IDEA Open Model
NumberGroups Class
Compatible with IDEA StatiCa v 10.1
 Defines used input of groups of numbers.
Inheritance Hierarchy
System.Object
 System.Collections.Generic.List<List<ValueCount>>
 IdeaRS.OpenModel.Parameters.NumberGroups
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public sealed class NumberGroups : List<List<ValueCount>>
Public NotInheritable Class NumberGroups
	Inherits List(Of List(Of ValueCount))
public ref class NumberGroups sealed : public List<List<ValueCount^>^>
The NumberGroups type exposes the following members.
Constructors
Name | Description
NumberGroups
Initializes a new instance of the NumberGroups class
Top
Methods
Name | Description
Create(IEnumerable<Double>)
 Creates new instance with one group with specified sequence of numbers.
Create(Double)
 Creates new instance with one group with one value.
Create(Double[])
 Creates new instance with one group with specified sequence of numbers.
Create(List<ValueCount>)
 Creates new instance with list of ValueCount .
Create(Double, Int32)
 Creates a new instance of one group with several values (defined by count).
CreateGroups(IEnumerable<Double>)
 Creates new instance with groups with with one value in group.
CreateGroups(Double[])
 Creates new instance with groups with with one value in group.
Top
See Also
Reference
IdeaRS.OpenModel.Parameters Namespace